gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
/*
 * Board Config
 *
 *  Created on: 3 Feb 2019
 *      Author: sdavi
 */



#include <stdio.h>
#include <ctype.h>
#include <string.h>
#include <stdint.h>
#include "Version.h"
#include "BoardConfig.h"
#include "RepRapFirmware.h"
#include "sd_mmc.h"
#include "SPI.h"
#include "HardwareSPI.h"
#include "HardwareSDIO.h"
#include "Platform/Platform.h"

#include "HybridPWM.h"
#include "ff.h"
#include "Hardware/SoftwareReset.h"
#include "Hardware/ExceptionHandlers.h"

#include "pinmap.h"

#if STM32H7
# include "stm32h7xx_ll_system.h"
# include "core_cm7.h"
#else
# include "stm32f4xx_ll_system.h"
# include "core_cm4.h"
#endif

#if SUPPORT_TMC22xx || SUPPORT_DMA_NEOPIXEL
# include "DMABitIO.h"
#endif

#include "Board.h"
#include "Boards/BIQU_SKR.h"
#include "Boards/FLY.h"
#include "Boards/FYSETC.h"
#include "Boards/Generic.h"

//Known boards with built in stepper configurations and pin table
// Note the generic entry must be the first entry in the table.
static constexpr BoardEntry LPC_Boards[] =
{
    {{"generic"},      PinTable_Generic,    ARRAY_SIZE(PinTable_Generic),    Generic_Defaults},
#if STM32H7
# if STM32H743xx
    {{"fly_super5"},      PinTable_FLY_SUPER5,    ARRAY_SIZE(PinTable_FLY_SUPER5),    fly_super5_Defaults},
    {{"fly_super8h7", "fly_super8_pro"},      PinTable_FLY_SUPER8H7,    ARRAY_SIZE(PinTable_FLY_SUPER8H7),    fly_super8h7_Defaults},
    {{"biquskr_se_bx_2.0"},      PinTable_BIQU_SKR_SE_BX_v2_0,    ARRAY_SIZE(PinTable_BIQU_SKR_SE_BX_v2_0),    biqu_skr_se_bx_v2_0_Defaults},
    {{"biquskr_3", "biquskr_3_ez"},      PinTable_BTT_SKR_3,    ARRAY_SIZE(PinTable_BTT_SKR_3),    btt_skr_3_Defaults},
# elif STM32H723xx
    {{"fly_super5_h723"},      PinTable_FLY_SUPER5,    ARRAY_SIZE(PinTable_FLY_SUPER5),    fly_super5_Defaults},
    {{"fly_super8_pro_h723"},      PinTable_FLY_SUPER8H7,    ARRAY_SIZE(PinTable_FLY_SUPER8H7),    fly_super8h7_Defaults},
    {{"fly_openpnp_tool"},      PinTable_FLY_OPENPNP_TOOL,    ARRAY_SIZE(PinTable_FLY_OPENPNP_TOOL),    fly_openpnp_tool_Defaults},
    {{"biquskr_3_h723", "biquskr_3_ez_h723"},      PinTable_BTT_SKR_3,    ARRAY_SIZE(PinTable_BTT_SKR_3),    btt_skr_3_Defaults},
    {{"fysetc_spider_king723"}, PinTable_FYSETC_SPIDER_KING407, ARRAY_SIZE(PinTable_FYSETC_SPIDER_KING407), fysetc_spider_king407_Defaults},
# endif
#else
    {{"biquskrpro_1.1"},      PinTable_BIQU_SKR_PRO_v1_1,    ARRAY_SIZE(PinTable_BIQU_SKR_PRO_v1_1),    biquskr_pro_1_1_Defaults},
    {{"biqugtr_1.0"},      PinTable_BIQU_GTR_v1_0,    ARRAY_SIZE(PinTable_BIQU_GTR_v1_0),    biqu_gtr_1_0_Defaults},
    {{"fly_e3_pro"},      PinTable_FLY_E3_PRO,    ARRAY_SIZE(PinTable_FLY_E3_PRO),    fly_e3_pro_Defaults},
    {{"fly_e3_prov3"},      PinTable_FLY_E3_PROV3,    ARRAY_SIZE(PinTable_FLY_E3_PROV3),    fly_e3_prov3_Defaults},
    {{"fly_f407zg"},      PinTable_FLY_F407ZG,    ARRAY_SIZE(PinTable_FLY_F407ZG),    fly_f407zg_Defaults},
    {{"fly_e3"},      PinTable_FLY_E3,    ARRAY_SIZE(PinTable_FLY_E3),    fly_e3_Defaults},
    {{"fly_e3_v2"},      PinTable_FLY_E3_V2,    ARRAY_SIZE(PinTable_FLY_E3_V2),    fly_e3_v2_Defaults},
    {{"fly_cdyv2", "fly_cdyv3"},      PinTable_FLY_CDYV2,    ARRAY_SIZE(PinTable_FLY_CDYV2),    fly_cdyv2_Defaults},
    {{"fly_super8"},      PinTable_FLY_SUPER8,    ARRAY_SIZE(PinTable_FLY_SUPER8),    fly_super8_Defaults},
#if HAS_SBC_INTERFACE    
    {{"fly_gemini"},      PinTable_FLY_GEMINI,    ARRAY_SIZE(PinTable_FLY_GEMINI),    fly_gemini_Defaults},    
    {{"fly_geminiv1.1"},      PinTable_FLY_GEMINI_V1_1,    ARRAY_SIZE(PinTable_FLY_GEMINI_V1_1),    fly_gemini_v1_1_Defaults},    
    {{"fly_geminiv2.0"},      PinTable_FLY_GEMINI_V2_0,    ARRAY_SIZE(PinTable_FLY_GEMINI_V2_0),    fly_gemini_v2_0_Defaults},    
    {{"fly_geminiv3.0"},      PinTable_FLY_GEMINI_V3_0,    ARRAY_SIZE(PinTable_FLY_GEMINI_V3_0),    fly_gemini_v3_0_Defaults},
#endif   
    {{"biquskr_rrf_e3_1.1"},      PinTable_BTT_RRF_E3_v1_1,    ARRAY_SIZE(PinTable_BTT_RRF_E3_v1_1),    btt_rrf_e3_1_1_Defaults},
    {{"biquskr_2"}, PinTable_BTT_SKR_2, ARRAY_SIZE(PinTable_BTT_SKR_2), btt_skr_2_Defaults},
    {{"biqoctopus_1.1", "biquoctopus_1.1"}, PinTable_BTT_OCTOPUS, ARRAY_SIZE(PinTable_BTT_OCTOPUS), btt_octopus_Defaults},
    {{"biqoctopuspro_1.0", "biquoctopuspro_1.0"}, PinTable_BTT_OCTOPUSPRO, ARRAY_SIZE(PinTable_BTT_OCTOPUSPRO), btt_octopuspro_Defaults},
    {{"biquoctopus_x7", "troodon_v2"}, PinTable_BIQU_OCTOPUS_X7, ARRAY_SIZE(PinTable_BIQU_OCTOPUS_X7), biquoctopus_x7_Defaults},
    {{"fysetc_spider"}, PinTable_FYSETC_SPIDER, ARRAY_SIZE(PinTable_FYSETC_SPIDER), fysetc_spider_Defaults},
    {{"fysetc_spider_king407"}, PinTable_FYSETC_SPIDER_KING407, ARRAY_SIZE(PinTable_FYSETC_SPIDER_KING407), fysetc_spider_king407_Defaults},
#endif
};
static constexpr size_t NumBoardEntries = ARRAY_SIZE(LPC_Boards);
static PinEntry *PinTable;
static size_t NumNamedLPCPins;
char lpcBoardName[MaxBoardNameLength];

static constexpr char boardConfigFile[] = "board.txt";

//Single entry for Board name
static const boardConfigEntry_t boardEntryConfig[]=
{
    {"board", &lpcBoardName, 1, cvStringType},
};

//All other board configs
static const boardConfigEntry_t boardConfigs[]=
{
    {"leds.diagnostic", &DiagPin, 1, cvPinType},
    {"leds.diagnosticOn", &DiagOnPolarity, 1, cvBoolType},
    {"leds.activity", &ActLedPin, 1, cvPinType},
    {"leds.activityOn", &ActOnPolarity, 1, cvBoolType},

    // initial pin states
    {"pins.SetHigh", PinsSetHigh, MaxInitialPins, cvPinType},
    {"pins.SetLow", PinsSetLow, MaxInitialPins, cvPinType},

    //Steppers
    {"stepper.powerEnablePin", &StepperPowerEnablePin, 1, cvPinType},
    {"stepper.enablePins", ENABLE_PINS, NumDirectDrivers, cvPinType},
    {"stepper.stepPins", STEP_PINS, NumDirectDrivers, cvPinType},
    {"stepper.directionPins", DIRECTION_PINS, NumDirectDrivers, cvPinType},
    {"stepper.digipotFactor", &digipotFactor, 1, cvFloatType},
#if HAS_SMART_DRIVERS
    {"stepper.TmcUartPins", TMC_PINS, NumDirectDrivers, cvPinType},
    {"stepper.DriverType", TMC_DRIVER_TYPE, NumDirectDrivers, cvDriverType},
    {"stepper.numSmartDrivers", &totalSmartDrivers, 1, cvUint32Type},
#if SUPPORT_TMC51xx
    {"stepper.num5160Drivers", &num5160SmartDrivers, 1, cvUint32Type},
    {"stepper.spiChannel", &SmartDriversSpiChannel, 1, cvUint8Type},
    {"stepper.csDelay", &SmartDriversSpiCsDelay, 1, cvUint32Type},
#endif
#if HAS_STALL_DETECT && SUPPORT_TMC22xx
    {"stepper.TmcDiagPins", DriverDiagPins, NumDirectDrivers, cvPinType},
#endif
#endif
    //Heater sensors
    {"heat.tempSensePins", TEMP_SENSE_PINS, NumThermistorInputs, cvPinType},
    {"heat.spiTempSensorCSPins", SpiTempSensorCsPins, MaxSpiTempSensors, cvPinType},
    {"heat.spiTempSensorChannel", &TempSensorSSPChannel, 1, cvUint8Type},
    {"heat.thermistorSeriesResistor", &DefaultThermistorSeriesR, 1, cvFloatType},
    
    //ATX Power
    {"atx.powerPin", &ATX_POWER_PIN, 1, cvPinType},
    {"atx.powerPinInverted", &ATX_POWER_INVERTED, 1, cvBoolType},
    {"atx.initialPowerOn", &ATX_INITIAL_POWER_ON, 1, cvBoolType},

    //SDCards
    {"sdCard.internal.spiFrequencyHz", &InternalSDCardFrequency, 1, cvUint32Type},
    {"sdCard.external.csPin", &SdSpiCSPins[1], 1, cvPinType},
    {"sdCard.external.cardDetectPin", &SdCardDetectPins[1], 1, cvPinType},
    {"sdCard.external.spiFrequencyHz", &ExternalSDCardFrequency, 1, cvUint32Type},
    {"sdCard.external.spiChannel", &ExternalSDCardSSPChannel, 1, cvUint8Type},

#if SUPPORT_12864_LCD
    {"lcd.lcdCSPin", &LcdCSPin, 1, cvPinType},
    {"lcd.lcdBeepPin", &LcdBeepPin, 1, cvPinType},
    {"lcd.encoderPinA", &EncoderPinA, 1, cvPinType},
    {"lcd.encoderPinB", &EncoderPinB, 1, cvPinType},
    {"lcd.encoderPinSw", &EncoderPinSw, 1, cvPinType},
    {"lcd.lcdDCPin", &LcdA0Pin, 1, cvPinType},
    {"lcd.panelButtonPin", &PanelButtonPin, 1, cvPinType},
    {"lcd.spiChannel", &LcdSpiChannel, 1, cvUint8Type},
#endif
    
    {"SPI0.pins", SPIPins[0], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI1.pins", SPIPins[1], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI2.pins", SPIPins[2], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI3.pins", SPIPins[3], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI4.pins", SPIPins[4], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI5.pins", SPIPins[5], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
#if STM32H7
    {"SPI6.pins", SPIPins[6], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI7.pins", SPIPins[7], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI8.pins", SPIPins[8], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
#endif
    
#if HAS_WIFI_NETWORKING
    {"8266wifi.espDataReadyPin", &EspDataReadyPin, 1, cvPinType},
    {"8266wifi.lpcTfrReadyPin", &SamTfrReadyPin, 1, cvPinType},
    {"8266wifi.TfrReadyPin", &SamTfrReadyPin, 1, cvPinType},
    {"8266wifi.espResetPin", &EspResetPin, 1, cvPinType},
    {"8266wifi.csPin", &SamCsPin, 1, cvPinType},
    {"8266wifi.serialRxTxPins", &WifiSerialRxTxPins, NumberSerialPins, cvPinType},
    {"8266wifi.spiChannel", &WiFiSpiChannel, 1, cvUint8Type},    
    {"8266wifi.clockReg", &WiFiClockReg, 1, cvUint32Type},
#endif

