gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
#if HAS_SBC_INTERFACE
    {"sbc.TfrReadyPin", &SbcTfrReadyPinConfig, 1, cvPinType},
    {"sbc.csPin", &SbcCsPinConfig, 1, cvPinType},
    {"sbc.spiChannel", &SbcSpiChannel, 1, cvUint8Type},    
    {"sbc.loadConfig", &SbcLoadConfig, 1, cvBoolType},    
#endif

#if defined(SERIAL_AUX_DEVICE)
    {"serial.aux.rxTxPins", &AuxSerialRxTxPins, NumberSerialPins, cvPinType},
#endif
#if defined(SERIAL_AUX2_DEVICE)
    {"serial.aux2.rxTxPins", &Aux2SerialRxTxPins, NumberSerialPins, cvPinType},
#endif
    
#if SUPPORT_LED_STRIPS
    {"led.neopixelPin", &NeopixelOutPin, 1, cvPinType},
#endif

#if HAS_VOLTAGE_MONITOR
    {"power.VInDetectPin", &PowerMonitorVinDetectPin, 1, cvPinType},
    {"power.voltage", &VInDummyReading, 1, cvUint32Type},
#endif
#if SUPPORT_ACCELEROMETERS
    {"accelerometer.spiChannel", &AccelerometerSpiChannel, 1, cvUint8Type},
#endif
#if SUPPORT_SPICAN
    {"can.spiChannel", &CanSpiChannel, 1, cvUint8Type},
    {"can.csPin", &CanCsPin, 1, cvPinType},
    {"can.spiFrequencyHz", &CanSpiFrequency, 1, cvUint32Type},
#endif
#if STM32H7
    {"can.readPin", &CanReadPin, 1, cvPinType},
    {"can.writePin", &CanWritePin, 1, cvPinType},
#endif
};


// Copy the default src pin array to dst array
static void SetDefaultPinArray(const Pin *src, Pin *dst, size_t len) noexcept
{
    //array is empty from board.txt config, set to defaults
    for(size_t i=0; i<len; i++)
    {
        dst[i] = src[i];
    }
}

static void ClearConfig() noexcept
{
    const size_t numConfigs = ARRAY_SIZE(boardConfigs);
    for(size_t i=0; i<numConfigs; i++)
    {
        boardConfigEntry_t next = boardConfigs[i];
        for(size_t p=0; p<(next.numItems); p++)
        {
            switch(next.type)
            {
                case cvPinType:
                    ((Pin *)(next.variable))[p] = NoPin;
                    break;
                case cvDriverType:
                    ((DriverType *)(next.variable))[p] = DriverType::unknown;
                    break;
                case cvBoolType:
                    ((bool *)(next.variable))[p] = false;
                    break;
                case cvFloatType:
                    ((float *)(next.variable))[p] = 0.0f;
                    break;
                case cvUint8Type:
                    ((uint8_t *)(next.variable))[p] = 0;
                    break;
                case cvUint16Type:
                    ((uint16_t *)(next.variable))[p] = 0;
                   break;
                case cvUint32Type:
                    ((uint32_t *)(next.variable))[p] = 0;
                    break;
                case cvStringType:
                    strcpy(((char **)(next.variable))[p], "");
                    break;
                default:
                    break;
            }
        }
    }
    // We have a few settings that have "special" default values
    TempSensorSSPChannel = SSPNONE;
    DefaultThermistorSeriesR = 4700.0;
    ATX_INITIAL_POWER_ON = true;
    SdSpiCSPins[0] = PA_4;
    SdCardDetectPins[0] = NoPin;
    SdSpiCSPins[1] = NoPin;
    SdCardDetectPins[1] = NoPin;
    ExternalSDCardFrequency = 4000000;
    ExternalSDCardSSPChannel = SSPNONE;
    InternalSDCardFrequency = 25000000;
    LcdSpiChannel = SSPNONE;
    DiagOnPolarity = true;
    ActOnPolarity = true;
    SmartDriversSpiChannel = SSPNONE;
#if HAS_WIFI_NETWORKING
    SamCsPin = PB_12;
    WiFiSpiChannel = SSP2;
#endif
#if defined(SERIAL_AUX_DEVICE)
    AuxSerialRxTxPins[0] = PA_10;
    AuxSerialRxTxPins[1] = PA_9;
#endif
#if HAS_SBC_INTERFACE
    SbcCsPinConfig = PB_12;
    SbcSpiChannel = SSP2;
#endif
#if SUPPORT_SPICAN
    CanSpiFrequency = 15000000;
#endif
#if STM32H7
    CanReadPin = PB_8;
    CanWritePin = PB_9;
#endif
#if HAS_VOLTAGE_MONITOR
    VInDummyReading = 24;
#endif
#if SUPPORT_ACCELEROMETERS
    AccelerometerSpiChannel = SSPNONE;
#endif
}

static void InitDiagPin()
{
    bool dummy;
    LogicalPin pin;
    if (LookupPinName("status", pin, dummy))
    {
        DiagPin = (Pin)pin;
    }
}

//Find Board settings from string
static bool SetBoard(const char* bn) noexcept
{
    const size_t numBoards = ARRAY_SIZE(LPC_Boards);
    for(size_t i=0; i<numBoards; i++)
    {
        for(size_t j=0; j < ARRAY_SIZE(LPC_Boards[0].boardName); j++)
            if(LPC_Boards[i].boardName[j] && StringEqualsIgnoreCase(bn, LPC_Boards[i].boardName[j]))
            {
                SafeStrncpy(lpcBoardName, bn, sizeof(lpcBoardName));
                PinTable = (PinEntry *)LPC_Boards[i].boardPinTable;
                NumNamedLPCPins = LPC_Boards[i].numNamedEntries;
                ClearConfig();
                //copy default settings
                for(size_t j = 0; j < ARRAY_SIZE(SPIPins); j++)
                    SetDefaultPinArray(LPC_Boards[i].defaults.spiPins[j], SPIPins[j], NumSPIPins);
                SetDefaultPinArray(LPC_Boards[i].defaults.enablePins, ENABLE_PINS, LPC_Boards[i].defaults.numDrivers);
                SetDefaultPinArray(LPC_Boards[i].defaults.stepPins, STEP_PINS, LPC_Boards[i].defaults.numDrivers);
                SetDefaultPinArray(LPC_Boards[i].defaults.dirPins, DIRECTION_PINS, LPC_Boards[i].defaults.numDrivers);
#if HAS_SMART_DRIVERS
                SetDefaultPinArray(LPC_Boards[i].defaults.uartPins, TMC_PINS, LPC_Boards[i].defaults.numDrivers);
                totalSmartDrivers = LPC_Boards[i].defaults.numSmartDrivers;
#endif
                digipotFactor = LPC_Boards[i].defaults.digipotFactor;
#if HAS_VOLTAGE_MONITOR
                PowerMonitorVinDetectPin = LPC_Boards[i].defaults.vinDetectPin;
#endif
                StepperPowerEnablePin = LPC_Boards[i].defaults.stepperPowerEnablePin;
#if HAS_SBC_INTERFACE
                SbcTfrReadyPinConfig = LPC_Boards[i].defaults.SbcTfrReadyPin;
                SbcCsPinConfig = LPC_Boards[i].defaults.SbcCsPin;
                SbcSpiChannel = LPC_Boards[i].defaults.SbcSpiChannel;
#endif
                InitDiagPin();
                return true;
            }
    }
    return false;
}

uint32_t crc32_for_byte(uint32_t r) 
{
    for(int j = 0; j < 8; ++j)
        r = (r & 1? 0: (uint32_t)0xEDB88320L) ^ r >> 1;
    return r ^ (uint32_t)0xFF000000L;
}

uint32_t crc32(const void *data, size_t n_bytes) 
{
    uint32_t table[0x100];
    uint32_t crc = 0;

