gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
static void FatalError(const char* fmt, ...) noexcept
{
    for(;;)
    {
        va_list vargs;
        va_start(vargs, fmt);
        reprap.GetPlatform().DebugMessage(fmt, vargs);
        va_end(vargs);
        delay(2000);
    }
}

static void MessageF(MessageType mtype, const char* fmt, ...) noexcept
{
    va_list vargs;
    va_start(vargs, fmt);
    reprap.GetPlatform().MessageV(mtype, fmt, vargs);
    va_end(vargs);
}

static void FlushMessages() noexcept
{
    uint32_t start = millis();
    while(reprap.GetPlatform().FlushMessages() && (millis() - start < 5000))
        ;
}

#if 0
static void CheckDriverPins() noexcept
{
    for(size_t i=0; i<NumDirectDrivers; i++)
    {
        if (ENABLE_PINS[i] != NoPin && STEP_PINS[i] != NoPin && DIRECTION_PINS[i] != NoPin)
        {
            pinMode(ENABLE_PINS[i], INPUT);
            bool state1 = IoPort::ReadPin(ENABLE_PINS[i]);
            pinMode(STEP_PINS[i], OUTPUT_LOW);
            delay(50);
            bool state2 = IoPort::ReadPin(ENABLE_PINS[i]);
            pinMode(STEP_PINS[i], INPUT);
            if (state1 != state2 && state2 == false)
            {
                FatalError("Possible short between step and enable pins on driver %d.\nPlease check driver installation/configuration.\n", i);
            }
        }
    }
}
#endif


static void UnknownHardware(uint32_t sig) noexcept
{
    for(;;)
    {
        debugPrintf("\nRRF has been unable to identify the current hardware.\n");
        debugPrintf("This may be because it is a new board or has a new bootloader installed.\n");
        debugPrintf("To register the hardware configuration please contact TeamGloomy via our\n");
        debugPrintf("discord server (https://discord.gg/uS97Qs7) and supply details of\n");
        debugPrintf("the board and the board signature(0x%x).\n", (unsigned)sig);
        delay(2000);
    }
}


static const char *GetBootloaderString() noexcept
{
    const uint32_t *BootVectors = (const uint32_t *)0x8000000;
    const char *BootloaderString = (const char *) BootVectors[8];
    // make sure it looks valid...
    if (BootloaderString == nullptr)
        return nullptr;
    if (Strnlen(BootloaderString, 128) >= 128)
        return nullptr;
    if (strstr(BootloaderString, " version ") == nullptr)
        return nullptr;
    return BootloaderString;
}

// Determine how to access the SD card
static uint32_t signature;
typedef struct {
    SSPChannel device;
    Pin pins[6];
    uint32_t mode[6];
} SDCardConfig;

// These are our known SD card configurations
static constexpr SDCardConfig SDCardConfigs[] = {
    {SSP1, {PA_5, PA_6, PB_5, PA_4, NoPin, NoPin}, {0x502, 0x502, 0x502, 0x1}}, // SKR Pro
    {SSP1, {PA_5, PA_6, PA_7, PA_4, NoPin, NoPin}, {0x502, 0x502, 0x502, 0x1}}, // GTR
    {SSPSDIO, {PC_8, PC_9, PC_10, PC_11, PC_12, PD_2}, {0xc02, 0xc02, 0xc02, 0xc02, 0xc02, 0xc02}}, // Fly/SDIO
    {SSP3, {PC_10, PC_11, PC_12, PC_9, NoPin, NoPin}, {0x602, 0x602, 0x602, 0x1}}, // MKS?
    {SSP3, {PC_10, PC_11, PC_12, PA_15, NoPin, NoPin}, {0x602, 0x602, 0x602, 0x1}}, // BTT BX
};

static bool CheckPinConfig(uint32_t config) noexcept
{
    // check to see if the pins are currently set in the expected state
    // The bootloader on many boards will leave the pins configured after
    // accessing the SD card.
    const SDCardConfig *conf = &SDCardConfigs[config];
    for(size_t i = 0; i < ARRAY_SIZE(conf->pins); i++)
        if (conf->pins[i] != NoPin && pin_get_function(conf->pins[i]) != conf->mode[i])
            return false;
    return true;
}

// Attempt to identify the board based upon the hardware we can see.
// Note that this may not be correct, but it should be sufficient to allow
// us to either connect to an SBC or mount an SD card from which we can get
// an actual board configuration.
static uint32_t IdentifyBoard() noexcept
{
    // We use the CRC of part of the bootloader to id the board
    signature = crc32((char *)0x8000000, 8192);
    // Try to find a matching board we accept the first match
    for(uint32_t i = 0; i < NumBoardEntries; i++)
        for(uint32_t j = 0; j < MaxSignatures; j++)
            if (LPC_Boards[i].defaults.signatures[j] == signature)
            {
                debugPrintf("Sig match 0x%x board %d %s\n", (unsigned) signature, (int)i, LPC_Boards[i].boardName[0]);
                SetBoard(LPC_Boards[i].boardName[0]);
                return i;
            }
    debugPrintf("Board signature %x not found\n", (unsigned)signature);
    // Look to see if it is our bootloader, if so we can use the IOMode to get to the SD card
    const char *bootstr = GetBootloaderString();
    uint32_t conf = SD_UNKNOWN;
    if (bootstr != nullptr)
    {
        debugPrintf("Found bootloader string \"%s\"\n", bootstr);
        char *iomodestr = strstr(bootstr, "IOMode:");
        if (iomodestr != nullptr)
        {
            conf = (uint32_t)StrToI32(iomodestr+7);
            debugPrintf("Got iomode %d\n", (unsigned)conf);
        }
    }
    if (conf == SD_UNKNOWN)
    {
        // failed to find matching signature, see if the bootloader has left things configured
        for(uint32_t i = 0; i < ARRAY_SIZE(SDCardConfigs); i++)
            if (CheckPinConfig(i))
            {
                conf = i;
                debugPrintf("loader match, iomode %d\n", (int)i);
            }
    }
    // If we now have an SD mode use it to pick a board (we choose the first match)
    if (conf != SD_UNKNOWN)
    {
        for(uint32_t i = 0; i < NumBoardEntries; i++)
        {
            if (LPC_Boards[i].defaults.SDConfig == conf)
            {
                debugPrintf("iomode match board %d %s\n", (int)i, LPC_Boards[i].boardName[0]);
                SetBoard(LPC_Boards[i].boardName[0]);
                return i;
            }
        }
    }
    // Unable to identify the board
    SetBoard("generic");
    return UNKNOWN_BOARD;
}

static bool TryConfig(uint32_t config, bool mount) noexcept
{
    const SDCardConfig *conf = &SDCardConfigs[config];
    if (conf->device != SSPSDIO)
    {
        ConfigureSPIPins(conf->device, conf->pins[0], conf->pins[1], conf->pins[2]);
        sd_mmc_setSSPChannel(0, conf->device, conf->pins[3]);
    }
    else
    {
        HardwareSDIO::SDIO1.InitPins(NvicPrioritySDIO);
        sd_mmc_setSSPChannel(0, conf->device, NoPin);
    }

    if (!mount) return true;

    GCodeResult rslt;
    String<100> reply;
    do
    {
        MassStorage::Spin();
        rslt = MassStorage::Mount(0, reply.GetRef(), false, 100);
    } while (rslt == GCodeResult::notFinished);
    if (rslt == GCodeResult::ok)
        return true;
    // mount failed, reset the hardware
    if (conf->device != SSPSDIO)
        ((HardwareSPI *)(SPI::getSSPDevice(conf->device)))->disable();
    for (size_t i = 0; i < ARRAY_SIZE(conf->pins); i++)
        pinMode(conf->pins[i], INPUT);    
    sd_mmc_setSSPChannel(0, SSPNONE, NoPin);
    return false;
}    

