gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
static SSPChannel InitSDCard(uint32_t boardId, bool mount, bool needed) noexcept
{
    int conf = LPC_Boards[boardId].defaults.SDConfig;

    if (conf == SD_UNKNOWN)
    {
        UnknownHardware(signature);
    }
    else if (conf == SD_NONE)
    {
        if (needed)
            FatalError("SD card is not supported on this board\n");
        return SSPNONE;
    }
    else
    {
        if (TryConfig(conf, mount))
        {
            return SDCardConfigs[conf].device;
        }
        if (needed)
            FatalError("Unable to mount SD card, board signature is 0x%x, boardId %d config %d.\n", signature, (int)boardId, conf);
        else
        {
            MessageF(UsbMessage, "Unable to mount SD card using config %d\n", conf);
            return SDCardConfigs[conf].device;
        }
    }
    FatalError("Failed to mount SD card\n");
    return SSPNONE;
}


void BoardConfig::Init() noexcept
{
    SSPChannel sdChannel = SSPNONE;
	String<100> reply;
#if !HAS_MASS_STORAGE
#error "Invalid board configuration HAS_MASS_STORAGE is required"
#endif
    signature = crc32((char *)0x8000000, 8192);
#if STARTUP_DELAY
    for(int i = 0; i < STARTUP_DELAY; i++)
    {
        delay(1);
        if (SERIAL_MAIN_DEVICE.IsConnected())
        {
            // For some reason if we start using USB straightaway we end up reading back some data we just
            // sent. Adding a small delay seems to fix the problem.
            delay(100);
            debugPrintf("RRF Started....\n");
            break;
        }
    }
#endif
    SetBoard("generic");
    uint32_t boardId = IdentifyBoard();
#if HAS_SBC_INTERFACE
    // See if there is an (optional) config file on the SD card
    sdChannel = InitSDCard(boardId, true, false);
    if (sdChannel == SSPNONE)
    {
        // Device does not have an SD card
        SbcLoadConfig = true;
    }
    else if (!BoardConfig::LoadBoardConfigFromFile())
    {
        // No SD card, or no board.txt
        MessageF(UsbMessage, "Warning: unable to load configuration from file\n");
        // Enable loading of config from the SBC
        SbcLoadConfig = true;
    }
    if (SbcLoadConfig)
    {
        MessageF(UsbMessage, "Using SBC based configuration files\n");
        // Check for a configuration stored in RAM (supplied by the SBC),
        // if found use it and override any config from the card
        InMemoryBoardConfiguration inMemoryConfig;
        inMemoryConfig.loadFromBackupRAM();
        if (inMemoryConfig.isValid())
        {
            MessageF(UsbMessage, "Using RAM based configuration data\n");
            inMemoryConfig.setConfiguration();
            // Set SD config if we haven't already
            if (!MassStorage::IsDriveMounted(0))
                sdChannel = InitSDCard(boardId, false, false);
        }
    }
    if (SbcCsPinConfig == NoPin)
    {
        FatalError("No SBC configuration\n");
        return;
    }
#else
    // Try and mount the sd card and read the board.txt file, error if not present
    sdChannel = InitSDCard(boardId, true, true);
    if (!BoardConfig::LoadBoardConfigFromFile())
    {
        // failed to load a valid configuration
        FatalError("Failed to load board configuration\n");
        return;
    }
#endif
    if (MassStorage::IsDriveMounted(0))
        MassStorage::Unmount(0, reply.GetRef());

#if HAS_SBC_INTERFACE
    if (SbcCsPinConfig == NoPin || SbcTfrReadyPinConfig == NoPin || SbcSpiChannel == SSPNONE)
    {
        FatalError("No SBC configuration\n");
        return;
    }
#endif
    //Calculate STEP_DRIVER_MASK (used for parallel writes)
    STEP_DRIVER_MASK = 0;
    // Currently not implemented for STM32
    #if 0
    for(size_t i=0; i<NumDirectDrivers; i++)
    {
        //It is assumed all pins will be on Port 2
        const Pin stepPin = STEP_PINS[i];
        if( stepPin != NoPin && (stepPin >> 5) == 2) // divide by 32 to get port number
        {
            STEP_DRIVER_MASK |= (1 << (stepPin & 0x1f)); //this is a bitmask of all the stepper pins on Port2 used for Parallel Writes
        }
        else
        {
            if(stepPin != NoPin)
            {
                // configured step pins are not on the same port - not using parallel writes
                hasStepPinsOnDifferentPorts = true;
            }
        }
    }
    #endif
    hasStepPinsOnDifferentPorts = true;
    
    //Does board have built in current control via digipots?
    if(digipotFactor > 1)
    {
        hasDriverCurrentControl = true;
    }
#if 0
    // anti-rotation detection feature disabled for now due to potential to damage some drivers
    CheckDriverPins();
#endif
#if HAS_SMART_DRIVERS
    ConfigureDriveType();
#endif       
    //Setup the SPI Pins, note that the SD SPI device may already have been configured
    for(size_t i = 0; i < ARRAY_SIZE(SPIPins); i++)
        if (sdChannel != (SSPChannel)i)
            ConfigureSPIPins((SSPChannel)i, SPIPins[i][0], SPIPins[i][1], SPIPins[i][2]);
#if HAS_MASS_STORAGE
    // Set internal SD card frequency (if supported)
    sd_mmc_reinit_slot(0, NoPin, InternalSDCardFrequency);
    if (ExternalSDCardSSPChannel != SSPNONE && SdSpiCSPins[1] != NoPin)
    {
        sd_mmc_setSSPChannel(1, ExternalSDCardSSPChannel, SdSpiCSPins[1]);
        sd_mmc_reinit_slot(1, NoPin, ExternalSDCardFrequency);
    }
    // Update RRF settings
    MassStorage::Init2();
#endif
#if HAS_SBC_INTERFACE
    pinMode(SbcCsPinConfig, INPUT_PULLUP);
    SbcTfrReadyPin = SbcTfrReadyPinConfig;
    SbcCsPin = SbcCsPinConfig;
#endif
#if HAS_WIFI_NETWORKING
    pinMode(SamCsPin, OUTPUT_LOW);
    pinMode(EspResetPin, OUTPUT_LOW);
    // Setup WiFi pins for compatibility
    APIN_ESP_SPI_MOSI = SPIPins[WiFiSpiChannel][2];
    APIN_ESP_SPI_MISO = SPIPins[WiFiSpiChannel][1];
    APIN_ESP_SPI_SCK = SPIPins[WiFiSpiChannel][0];
    
    if(WifiSerialRxTxPins[0] != NoPin && WifiSerialRxTxPins[1] != NoPin)
    {
        //Setup the Serial Port for ESP Wifi
        APIN_SerialWiFi_RXD = WifiSerialRxTxPins[0];
        APIN_SerialWiFi_TXD = WifiSerialRxTxPins[1];
        
        if(!serialWiFi.Configure(WifiSerialRxTxPins[0], WifiSerialRxTxPins[1]))
        {
            reprap.GetPlatform().MessageF(UsbMessage, "Failed to set WIFI Serial with pins %c.%d and %c.%d.\n", 'A'+(WifiSerialRxTxPins[0] >> 4), (WifiSerialRxTxPins[0] & 0xF), 'A'+(WifiSerialRxTxPins[1] >> 4), (WifiSerialRxTxPins[1] & 0xF) );
        }
    }
#endif

#if defined(SERIAL_AUX_DEVICE)
    //Configure Aux Serial
    if(AuxSerialRxTxPins[0] != NoPin && AuxSerialRxTxPins[1] != NoPin)
    {
        if(!SERIAL_AUX_DEVICE.Configure(AuxSerialRxTxPins[0], AuxSerialRxTxPins[1]))
        {
            reprap.GetPlatform().MessageF(UsbMessage, "Failed to set AUX Serial with pins %c.%d and %c.%d.\n", 'A'+(AuxSerialRxTxPins[0] >> 4), (AuxSerialRxTxPins[0] & 0xF), 'A'+(AuxSerialRxTxPins[1] >> 4), (AuxSerialRxTxPins[1] & 0xF) );
        }

